org/episodes.org
#+HUGO_SECTION: episode
#+HUGO_BASE_DIR: ../
#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t
# ensure only a single author is listed, not an array otherwise breaks castinet theme?
# https://github.com/kaushalmodi/ox-hugo/issues/180
#+AUTHOR:
#+HUGO_CUSTOM_FRONT_MATTER: :author "Alex Murray" :explicit no :episode_image img/episode/default.png

* Episode 6
:PROPERTIES:
:EXPORT_FILE_NAME: episode-6
:EXPORT_DATE: 2018-10-02
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :episode_image img/episode/default.png :explicit no :podcast_file USP_E006.mp3 :podcast_duration "11:56" :podcast_bytes "11472272"
:END:
#+begin_description
This week we look at some details of the 17 unique CVEs addressed across the supported Ubuntu releases and more.
#+end_description
** Overview
This week we look at some details of the 17 unique CVEs addressed across the supported Ubuntu releases and more.
** This week in Ubuntu Security Updates
17 unique CVEs addressed
*** [[[https://usn.ubuntu.com/3771-1/][USN-3771-1]]] strongSwan vulnerabilities
- 4 CVEs addressed in Trusty, Xenial, Bionic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-5388][CVE-2018-5388]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-16152][CVE-2018-16152]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-16151][CVE-2018-16151]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-10811][CVE-2018-10811]]
- 2 CVEs: flaws in RSA implementation allow Bleichenbacher-style attacks in parsing of the ASN.1 encoded digestInfo
- strongSwan implementation was too lenient and would allow arbitrary random data to be contained following various elements in the ASN.1
- Also would not check the correct amount of padding had been used
- Allows attackers to potentially forge low-exponent signature forgery and hence authentication during IKE authentication
- 2 CVEs for DoS due to missing length check and missing variable initialization
*** [[[https://usn.ubuntu.com/3772-1/][USN-3772-1]]] UDisks vulnerability
- 1 CVEs addressed in Bionic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-17336][CVE-2018-17336]]
- Format string vulnerability which could be exploited via specially crafted disk label
- udisks prints volume label via printf() passing the label as part of the format string
  - Simple fix to replace the label with a %s directive and then pass the label to that
  - ie. don't interpret label as printf() directives directly
*** [[[https://usn.ubuntu.com/3719-3/][USN-3719-3]]] Mutt vulnerabilities
- 12 CVEs addressed in Xenial
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14349][CVE-2018-14349]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14362][CVE-2018-14362]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14351][CVE-2018-14351]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14356][CVE-2018-14356]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14355][CVE-2018-14355]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14357][CVE-2018-14357]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14353][CVE-2018-14353]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14358][CVE-2018-14358]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14359][CVE-2018-14359]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14354][CVE-2018-14354]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14352][CVE-2018-14352]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-14350][CVE-2018-14350]]
** Goings on in Ubuntu Security Community
*** LSM Stacking upstreaming
- Casey Schaufler (Intel, SMACK maintainer) primary developer along with John Johansen and Kees Cook (Google) to upstream support for LSM stacking
- Currently upstream allows use of one 'major' module (SELinux / AppArmor / Tomoyo) with a minor module (Yama etc)
- Goal of stacking is to allow multiple major modules to be used in conjunction (AppArmor with SELinux)
  - Primary use-case is containers
- Current stacking patches allow to stack Tomoyo with either SELinux / AppArmor
  - Eventually should be able to stack SELinux with AppArmor but still WIP
  - Ubuntu already carries these patches in Bionic etc
- Likely to be merged in the near future
*** Evince AppArmor hardening [[https://bugs.launchpad.net/ubuntu/+source/evince/+bug/1788929][LP #1788929]]
- Jann Horn (GPZ) reported gaps in evince AppArmor profile
- Clever use of GNOME thumbnailer infrastructure to specify a new 'evil' thumbnailer and the use of systemd via DBus to escape AppArmor confinement
- Policy fixed in Cosmic, in process of updating for Bionic etc
*** New Ubuntu Security Manager
- Joe McManus
*** Hiring
**** Ubuntu Security Engineer
- https://boards.greenhouse.io/canonical/jobs/1158266
** Get in contact
- [[mailto:security@ubuntu.com][security@ubuntu.com]]
- [[http://webchat.freenode.net?channels=%2523ubuntu-hardened&uio=d4][#ubuntu-hardended on the Freenode IRC network]]
- [[https://twitter.com/ubuntu_sec][@ubuntu_sec on twitter]]

